backend/themes/qltk2/user/_form.php


    <div class="form-group">
        <?=Html::label('Vai trò');?>
        <?=Html::checkboxList('Vaitrouser[]', $vaitros, \yii\helpers\ArrayHelper::map(
            \backend\models\VaiTro::find()->all(), 'id', 'name'
        ), ['prompt' => '', 'class' => 'list-block'])?>
---
SELECT * FROM `qlcvsd_vai_tro`