backend/controllers/DanhMucController.php

SELECT * FROM `qlcvsd_danh_muc` WHERE (`active`=1) AND (`parent_id`='9')
---
    public function actionTimPhongO()
    {
        if(!isset($_POST['ngayTu'])){
            $phongos = DanhMuc::findAll(['active' => 1, 'parent_id' => $_POST['idToaNha']]);
        }else{
            $ngayTu = DateTime::createFromFormat('d/m/Y H:i', $_POST['ngayTu'])->format('Y-m-d H:i:s');
            $ngayDen = DateTime::createFromFormat('d/m/Y H:i', $_POST['ngayDen'])->format('Y-m-d H:i:s');

            $phongos = \backend\models\DanhMuc::find()
                ->alias('dm')
                ->andFilterWhere(['dm.parent_id' => $_POST['idToaNha']])
                ->andFilterWhere(['dm.active' => 1])
                ->leftJoin('qlcvsd_phong_khach qlpk', 'qlpk.phong_id = dm.id')
                ->andWhere([
                    'or',
                    ['qlpk.phong_id' => null],
                    [
                        'and',
                        ['or',
                            ['<', 'qlpk.thoi_gian_hop_dong_den', $ngayTu],
                            ['>', 'qlpk.thoi_gian_hop_dong_tu', $ngayDen],
                        ],
                        ['!=', 'qlpk.trang_thai', PhongKhach::HOAN_THANH],
                        ['qlpk.active' => 1]
                    ]
                ])
                ->all();
        }
        $phongos = DanhMuc::findAll(['active' => 1, 'parent_id' => $_POST['idToaNha']]);

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`='10'
---
    public function actionGetDonGiaPhong()
    {
        $model = DanhMuc::findOne($_POST['idPhong']);

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
SELECT * FROM `qlcvsd_danh_muc` WHERE `active`=1 ORDER BY `id`
---
    public function actionView()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );
        $toaNhaID = DanhMuc::find()
            ->andFilterWhere(['active' => 1])
            ->orderBy(['id' => SORT_ASC])
            ->one();

SELECT * FROM `qlcvsd_phieu_chi` WHERE (`thang`='4') AND (`nam`='2025') AND (`active`=1) AND (`toa_nha_id`=9)
SELECT * FROM `qlcvsd_chi_tiet_chi_phi` WHERE `phieu_chi_id`=3
---
    public function actionGetChiPhi()
    {
        $thang = $_POST['thang'];
        $nam = $_POST['nam'];

        $phieuChi = PhieuChi::findOne([
            'thang' => $thang,
            'nam' => $nam,
            'active' => 1,
            'toa_nha_id' => intval($_POST['toaNhaID'])
        ]);

        if (is_null($phieuChi)){
            $phieuChi = new PhieuChi();
            $phieuChi->thang = $thang;
            $phieuChi->nam = $nam;
            $phieuChi->toa_nha_id = intval($_POST['toaNhaID']);
            $phieuChi->save();
        }
        Yii::$app->response->format = Response::FORMAT_JSON;
        $chiTiets = ChiTietChiPhi::findAll(['phieu_chi_id' => $phieuChi->id]);

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`='10'
---
    public function actionGetBangGia()
    {
        $phong = DanhMuc::findOne($_POST['id']);