backend/controllers/HoaDonController.php

    public function actionGetHoaDon()
    {
        $thang = intval($_POST['thang']);
        $nam = intval($_POST['nam']);
        $kieuTienNuoc = $_POST['kieuTienNuoc'];
        $typeHienThi = 'hien_thi';

        if (intval($thang) == (int)date('m')-1 && intval($nam) == (int)date('Y') ||
            (intval($thang) == 12 && intval($nam) == (int)date('Y') - 1 && (int)date('m') == 1) ||
            intval($thang) == (int)date('m') && intval($nam) == (int)date('Y') ||
            intval($thang) == (int)date('m') + 1 && intval($nam) == (int)date('Y') ||
            intval($thang) == 1 && intval($nam) == (int)date('Y') + 1){
            $typeHienThi = 'so_nuoc';
            if ($kieuTienNuoc == 'so_nguoi'){
                $typeHienThi = 'so_nguoi';
            }
        }

        $toa_nha_id = $_POST['toa_nha_id'];
        $hoaDons = QuanLyHoaDon::find()
            ->andFilterWhere(['!=', 'trang_thai', HoaDon::HOAN_THANH])
            ->andFilterWhere(['thang' => $thang])
            ->andFilterWhere(['nam' => $nam])
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id'=> $toa_nha_id])
            ->andFilterWhere(['loai_hop_dong' => 'thang'])->all();
---
SELECT * FROM `qlcvsd_quan_ly_hoa_don` WHERE (`trang_thai` != 'Hoàn thành') AND (`thang`=4) AND (`nam`=2025) AND (`active`=1) AND (`parent_id`='9') AND (`loai_hop_dong`='thang')

        foreach ($hoaDons as $hoaDon){
            $hang = [];
            $tongTien = $hoaDon->tien_phong;
            $phong = DanhMuc::findOne($hoaDon->phong_id);
---
SELECT * FROM `qlcvsd_danh_muc` WHERE `id`=10

            $hang['so_nguoi'] = $hoaDon->so_nguoi;
            $hang['phong'] = $phong->name;

            $hang['anhDien'] = ChiTietHoaDon::find()
            ->andFilterWhere(['hoa_don_id'=>$hoaDon->id])
            ->andFilterWhere(['dich_vu_id'=>2])->one()->anh;

            $chiTiets = ChiTietHoaDon::findAll(['hoa_don_id'=>$hoaDon->id]);
---
SELECT * FROM `qlcvsd_chi_tiet_hoa_don` WHERE (`hoa_don_id`=652) AND (`dich_vu_id`=2)
SELECT * FROM `qlcvsd_chi_tiet_hoa_don` WHERE `hoa_don_id`=652

            $hang['da_thanh_toan'] = number_format($hoaDon->da_thanh_toan, 0, ',', '.');
            $hang['tien_nuoc'] = number_format($hoaDon->so_nguoi * $phong->gia_nuoc_nguoi, 0, ',', '.');
            $trangThai = 'Chưa tạo giao dịch';
            $giaoDichs = GiaoDich::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['hoa_don_id'=>$hoaDon->id])->all();
---
SELECT * FROM `qlcvsd_giao_dich` WHERE (`active`=1) AND (`hoa_don_id`=652)

        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        return [
            'success' => true,
            'content' => $this->renderPartial('danh-sach', [
                'dichVus' => ThietLapGia::find()->all(),
                'results' => $result,
                'typeHienThi' => $typeHienThi
            ]),
---
SELECT * FROM `qlcvsd_thiet_lap_gia`

            $conNo += $hoaDon->tong_tien - $hoaDon->da_thanh_toan;
            $daThanhToan += $hoaDon->da_thanh_toan;
        }
        $hoaDonDaTT = QuanLyHoaDon::find()
            ->andFilterWhere(['active' => 1])
            ->andFilterWhere(['parent_id' => $toaNhaID])
            ->andFilterWhere(['thang' => $thangTruoc])
            ->andFilterWhere(['nam' => $namHienTai])
            ->andFilterWhere(['>=', 'da_thanh_toan', 'tong_tien'])
            ->all();
---
SELECT * FROM `qlcvsd_quan_ly_hoa_don` WHERE (`active`=1) AND (`parent_id`='9') AND (`thang`=5) AND (`nam`=2025) AND (`da_thanh_toan` < tong_tien)