backend/controllers/PhongKhachController.php

SELECT * FROM `qlcvsd_danh_muc` WHERE parent_id is null and active = 1
---
    public function actionCreate()
    {
        $toanhaids = ArrayHelper::map(
            \backend\models\DanhMuc::find()->andWhere('parent_id is null and active = 1')->all(),
            'id',
            'name'
        );

SELECT * FROM `qlcvsd_danh_muc` WHERE `id`='10'
SELECT * FROM `qlcvsd_quan_ly_phong_khach` WHERE (`phong_id`=10) AND (`trang_thai` != 'Hoàn thành') AND (`active`=1)
---
    public function actionGetLichDat()
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $phong = DanhMuc::findOne($_POST['id']);
        $hopDongs = QuanLyPhongKhach::find()
            ->andFilterWhere(['phong_id'=>$phong->id])
            ->andFilterWhere(['!=','trang_thai',PhongKhach::HOAN_THANH])
            ->andFilterWhere(['active'=>1])->all();